app/controllers/errors_controller.rb

  def index
    @errors = Error.order(params[:sort])
---
SELECT "errors".* FROM "errors" ORDER BY person_assigned

  def create
    @error = Error.new(error_params)
    @error = current_user.error.build(error_params)

    respond_to do |format|
      if @error.save
---
INSERT INTO "errors" ("name", "priority", "description", "person_assigned", "date_found", "created_at", "updated_at", "progress", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"

  def update
    respond_to do |format|
      if @error.update(error_params)
---
UPDATE "errors" SET "description" = ?, "updated_at" = ? WHERE "errors"."id" = ?  [["description", "Poodles"], ["updated_at", "2024-04-24 19:45:39.659959"], ["id", 5]]

  def destroy
    @error.destroy!
---
DELETE FROM "errors" WHERE "errors"."id" = ?  [["id", 5]]

  def correct_user
    @error = current_user.error.find_by(id: params[:id])
---
SELECT "errors".* FROM "errors" WHERE "errors"."user_id" = ? AND "errors"."id" = ? LIMIT ?  [["user_id", 4], ["id", 5], ["LIMIT", 1]]

    def set_error
      @error = Error.find(params[:id])
---
SELECT "errors".* FROM "errors" WHERE "errors"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]